console.log("** תכנות א-סנכרוני **");
//קוד נקרא מלמעלה למטה
//תכנות סנכרוני עובד בצורה הבאה
// 1
// |
// 2
// |
// 3
// |
// 4

//תכנות א-סנכרוני עובד בצורה הבאה
// 1 -------->
// |         |
// 2         |
// |         | 
// 3         |
// |         |
// 4 <--------
//מתחיל פעולה ועד שהוא מסיים אותה הוא יכול לעשות כמה פעולות ביחד
//לדוגמא תיקחו מסעדה ותארו לכם שהמלצרים היו רובוטים והמלצר היה לוקח הזמנה ומחכה כמו גולם עד שהמנה תהיה מוכנה במקום שבזמן הזה הוא יקח עוד הזמנות

//זה בעצם נוצר כדי שפונקציות אחרות ירוצו בזמן שפונקציה תסיים על רוץ על הפונקציה שלה

const fn1 = () => {
    setTimeout(() => {
        console.log('function 1');

    }, 200);
};

const fn2 = () => {
    console.log('function 2');
}

fn1();
fn2();

//יצרתי שתי פונקציות פונקציה ראשונה עיקבתי אותה מ2 שניות והפונקציה השנייה רגיל הרצתי את שתי הפונקציות ועד שהפונקציה הראשונה הסתיימה הפונקציה השנייה סיימה להריץ את עצמה